# SetSegments Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinePattern..::..SetSegments Method
LinePattern Class See Also
---
Sets the sequence of segments that defines this line pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetSegments(
	IList<LinePatternSegment> lineSegs
)
```

Visual Basic
---
```text
Public Sub SetSegments ( _
	lineSegs As IList(Of LinePatternSegment) _
)
```

Visual C++
---
```text
public:
void SetSegments(
	IList<LinePatternSegment^>^ lineSegs
)
```

# ### Parameters
lineSegs
    Type: System.Collections.Generic..::..IList<(Of <(<'LinePatternSegment>)>)> The sequence of segments.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
LinePattern Class
Autodesk.Revit.DB Namespace